app/controllers/comments_controller.rb

  def create
    @post = Post.friendly.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
INSERT INTO "comments" ("author_name", "author_url", "body", "created_at", "post_id", "title", "updated_at") VALUES ('Joe Noname', 'http://ts.sch.gr/', 'This is a new comment. Your post is awesome, commenter #1 approves!', '2010-11-25 15:37:51.629830', 7, NULL, '2010-11-25 15:37:51.629830')