app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1